---
kind: property
id: P:Autodesk.Revit.DB.NavisworksExportOptions.ConvertLights
source: html/4ed38415-7618-db70-8b74-148e39468a79.htm
---
# Autodesk.Revit.DB.NavisworksExportOptions.ConvertLights Property

True to convert lights, false otherwise.
 Default value is false.

## Syntax (C#)
```csharp
public bool ConvertLights { get; set; }
```